#include <iostream>
#include <fstream>
#include "func.h"

using namespace std;

void printHeader(ofstream& f) {
    f << "|     |          Изначально по неубыванию         |         Изначально по невозрастанию       |             Случайным образом             |" << endl;
    f << "|     | Кол-во     | Кол-во     | Кол-во          | Кол-во     | Кол-во     | Кол-во          | Кол-во     | Кол-во     | Кол-во          |" << endl;
    f << "|     | сравнений  | сравнений  | перестановок    | сравнений  | сравнений  | перестановок    | сравнений  | сравнений  | перестановок    |" << endl;
    f << "|     | с элем.    | не с элем. |                 | с элем.    | не с элем. |                 | с элем.    | не с элем. |                 |" << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
}

int main() {
    int n = 100000;
    ofstream f("table1.txt");

    printHeader(f);

    f << getSortingTableRow(1, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
    f << getSortingTableRow(2, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
    f << getSortingTableRow(3, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
    f << getSortingTableRow(4, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
    f << getSortingTableRow(5, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
    f << getSortingTableRow(6, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
    f << getSortingTableRow(7, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;
    f << getSortingTableRow(8, n) << endl;
    f << "|-----|------------|------------|-----------------|------------|------------|-----------------|------------|------------|-----------------|" << endl;

    f.close();
    cout << "Файл table1.txt успешно создан." << endl;
    return 0;
}